# Introduction to pandas

###### Pandas is a python library used for data manipulation and analysis.It contain potentially hetrogenious tabular data with labeld axis such as column and row and Arithmetic operations align on both row and column labels.

Pandas are built on library called numpy

In [5]:
#importing pandas
import pandas as pd
import numpy as np

In [20]:
# Creation of pandas series
ps1=pd.Series([1,2,3,4])
ps

A    1
B    2
C    3
D    4
dtype: int64

In [21]:
#We can assign name to series
ps1=pd.Series([1,2,3,4],name='Num')
ps

A    1
B    2
C    3
D    4
dtype: int64

In [22]:
# Getting the values of series using 
ps1.values

array([1, 2, 3, 4])

In [23]:
# Getting the index using
ps1.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
#
ps1[0],ps1[1:3]

(1, 1    2
 2    3
 Name: Num, dtype: int64)

In [25]:
# Assign name to index
ps1=pd.Series([1,2,3,4],index=['A','B','C','D'])

In [26]:
ps1

A    1
B    2
C    3
D    4
dtype: int64

In [27]:
ps1[1:2]

B    2
dtype: int64

In [28]:
ps1['A':'D']

A    1
B    2
C    3
D    4
dtype: int64

## Different type of indexing panda
loc: loc gets rows (or columns) with particular labels from the index.   
iloc: iloc gets rows (or columns) at particular positions in the index (so it only takes integers).

In [29]:
ps.iloc[1:2]

B    2
dtype: int64

In [19]:
ps.loc['A':'C']

A    1
B    2
C    3
dtype: int64

### Combining two data frame in pandas

In [30]:
ps1=pd.Series([1,2,3,4],index=['A','B','C','D'])
ps2=pd.Series({'A':3,'B':5,'C':8,'D':9})

In [31]:
ps2

A    3
B    5
C    8
D    9
dtype: int64

In [32]:
ps_combine=pd.DataFrame({'1':ps1,'2':ps2})

In [33]:
ps_combine

   1  2
A  1  3
B  2  5
C  3  8
D  4  9

In [34]:
# Sorting the values
ps_combine=ps_combine.sort_values('2',ascending=False) # sorting based on second column

In [35]:
ps_combine

   1  2
D  4  9
C  3  8
B  2  5
A  1  3

In [36]:
ps_combine.values

array([[4, 9],
       [3, 8],
       [2, 5],
       [1, 3]])

In [38]:
ps_combine.index

Index(['D', 'C', 'B', 'A'], dtype='object')

In [39]:
ps_combine.columns

Index(['1', '2'], dtype='object')

In [43]:
# mathematical operations between columns
ps_combine['avg']=0.5*(ps_combine['1']+ps_combine['2'])
ps_combine

   1  2  avg
D  4  9  6.5
C  3  8  5.5
B  2  5  3.5
A  1  3  2.0

#### Some more operations using pandas

In [48]:
professors=pd.DataFrame([{'Name':'Lee','Age':45,'Department':'Mathematics'},{'Name':'Mamtha','Age':41,'Department':'Biology'},
                      {'Name':'John','Age':55,'Department':'Civil'}])

In [49]:
professors

   Age   Department    Name
0   45  Mathematics     Lee
1   41      Biology  Mamtha
2   55        Civil    John

In [51]:
# Change the index
professors_index=professors.set_index("Name")
professors_index

        Age   Department
Name
Lee      45  Mathematics
Mamtha   41      Biology
John     55        Civil

In [52]:
professors_index.iloc[:2]

        Age   Department
Name
Lee      45  Mathematics
Mamtha   41      Biology

In [53]:
professors_index.loc['Lee':]

        Age   Department
Name
Lee      45  Mathematics
Mamtha   41      Biology
John     55        Civil

In [54]:
professors_index.loc['Lee']['Age']

45

In [55]:
professors_index['Age']['Lee']

45

In [56]:
professors_Country=pd.DataFrame([{'prof':'Lee','Country':'China'},{'prof':'Mamtha','Country':'India'}])

In [57]:
professors_Country

  Country    prof
0   China     Lee
1   India  Mamtha

In [60]:
# Merging two data frame
pd.merge(professors,professors_Country,left_on='Name',right_on='prof').drop('prof',axis=1)

   Age   Department    Name Country
0   45  Mathematics     Lee   China
1   41      Biology  Mamtha   India

In [61]:
pd.merge(professors,professors_Country,left_on='Name',right_on='prof',how='left').drop('prof',axis=1)

   Age   Department    Name Country
0   45  Mathematics     Lee   China
1   41      Biology  Mamtha   India
2   55        Civil    John     NaN